cask_args appdir: "/Applications"

tap "caskroom/cask"

brew "git"
# brew "heroku-toolbelt" # removed because it prematurely installs node
brew "mas"
# brew "nvm" # not officially supported to install via homebrew
brew "pyenv"
brew "rbenv"
brew "zsh"
# brew "zsh-completions"
brew "watchman" # for react native development
brew "yarn" # fast dependency manager
brew "golang"

cask "adobe-acrobat-reader"
cask "atom"
cask "dropbox"
# cask "flux"
cask "franz"
cask "google-chrome"
cask "iterm2"
cask "moom"
# cask "sequel-pro"
cask "skype"
cask "sublime-text"
cask "transmission"
cask "vlc"
cask "xquartz"

mas "Amphetamine", id: 937984704
# mas "iStudiez Pro", id: 402989379
mas "The Unarchiver", id: 425424353
mas "Xcode", id:497799835